[Killed] Block removal mutation
Bank.cs:12:9
         private Bank(Dictionary<string, double> exchangeRates) => _exchangeRates = exchangeRates;
 
         public static Bank WithExchangeRate(Currency from, Currency to, double rate)
-        {
-            var bank = new Bank(new Dictionary<string, double>());
-            bank.AddExchangeRate(from, to, rate);
-
-            return bank;
-        }
+        {}
 
         public void AddExchangeRate(Currency from, Currency to, double rate) 

[Killed] Statement mutation
Bank.cs:14:13
         public static Bank WithExchangeRate(Currency from, Currency to, double rate)
         {
             var bank = new Bank(new Dictionary<string, double>());
-            bank.AddExchangeRate(from, to, rate);
+            ;
 
             return bank;

[Killed] Negate expression
Bank.cs:25:13
         private static string KeyFor(Currency from, Currency to) => $"{from}->{to}";
 
         public double Convert(double amount, Currency from, Currency to) =>
-            CanConvert(from, to)
+            !(            CanConvert(from, to)
+)
                 ? ConvertSafely(amount, from, to)
                 : throw new MissingExchangeRateException(from, to);

[Killed] Equality mutation
Bank.cs:30:13
                 : throw new MissingExchangeRateException(from, to);
 
         private double ConvertSafely(double amount, Currency from, Currency to) =>
-            to == from
+                        to != from
+
                 ? amount
                 : amount * _exchangeRates[KeyFor(from, to)];

[Killed] Arithmetic mutation
Bank.cs:32:19
         private double ConvertSafely(double amount, Currency from, Currency to) =>
             to == from
                 ? amount
-                : amount * _exchangeRates[KeyFor(from, to)];
+                : amount / _exchangeRates[KeyFor(from, to)];
 
         private bool CanConvert(Currency from, Currency to) =>

[Killed] Equality mutation
Bank.cs:35:13
                 : amount * _exchangeRates[KeyFor(from, to)];
 
         private bool CanConvert(Currency from, Currency to) =>
-            from == to || _exchangeRates.ContainsKey(KeyFor(from, to));
+                        from != to  || _exchangeRates.ContainsKey(KeyFor(from, to));
     }
 }

[Killed] Logical mutation
Bank.cs:35:13
                 : amount * _exchangeRates[KeyFor(from, to)];
 
         private bool CanConvert(Currency from, Currency to) =>
-            from == to || _exchangeRates.ContainsKey(KeyFor(from, to));
+                        from == to && _exchangeRates.ContainsKey(KeyFor(from, to));
     }
 }
