[Killed] String mutation
MissingExchangeRateException.cs:6:20
     public sealed class MissingExchangeRateException : Exception
     {
         public MissingExchangeRateException(Currency from, Currency to)
-            : base($"{from}->{to}")
+            : base($"")
         {
         }
