[Survived] Arithmetic mutation
MoneyCalculator.cs:5:87
 
 public static class MoneyCalculator
 {
-    public static double Add(double amount, Currency currency, double addedAmount) => amount + addedAmount;
+    public static double Add(double amount, Currency currency, double addedAmount) => amount - addedAmount;
     public static double Times(double amount, Currency currency, int times) => amount * times;
     public static double Divide(double amount, Currency currency, int divisor) => amount / divisor;

[Killed] Arithmetic mutation
MoneyCalculator.cs:6:80
 public static class MoneyCalculator
 {
     public static double Add(double amount, Currency currency, double addedAmount) => amount + addedAmount;
-    public static double Times(double amount, Currency currency, int times) => amount * times;
+    public static double Times(double amount, Currency currency, int times) => amount / times;
     public static double Divide(double amount, Currency currency, int divisor) => amount / divisor;
 }

[Killed] Arithmetic mutation
MoneyCalculator.cs:7:83
 {
     public static double Add(double amount, Currency currency, double addedAmount) => amount + addedAmount;
     public static double Times(double amount, Currency currency, int times) => amount * times;
-    public static double Divide(double amount, Currency currency, int divisor) => amount / divisor;
+    public static double Divide(double amount, Currency currency, int divisor) => amount * divisor;
 }
