[Killed] String mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:30:9
         results.Any(result => result.IsLeft);
 
     private string ToFailure(IEnumerable<Either<string, Money>> results) =>
-        $"Missing exchange rate(s): {GetMissingRates(results.Where(result => result.IsLeft).Select(result => result.IfRight(string.Empty)))}";
+        $"";
 
     private static string GetMissingRates(IEnumerable<string> missingRates) => missingRates

[Killed] String mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:33:26
         $"Missing exchange rate(s): {GetMissingRates(results.Where(result => result.IsLeft).Select(result => result.IfRight(string.Empty)))}";
 
     private static string GetMissingRates(IEnumerable<string> missingRates) => missingRates
-        .Select(value => $"[{value}]")
+        .Select(value => $"")
         .Aggregate((r1, r2) => $"{r1},{r2}");
 

[Killed] String mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:34:32
 
     private static string GetMissingRates(IEnumerable<string> missingRates) => missingRates
         .Select(value => $"[{value}]")
-        .Aggregate((r1, r2) => $"{r1},{r2}");
+        .Aggregate((r1, r2) => $"");
 
     private Money ToSuccess(IEnumerable<Either<string, Money>> results, Currency currency) =>
