[Killed] Equality mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Bank.cs:22:13
         private static string KeyFor(Currency from, Currency to) => $"{from}->{to}";
         
         private Money ConvertSafely(Money money, Currency to) =>
-            to == money.Currency
+                        to != money.Currency
+
                 ? money
                 : money with { Amount = money.Amount * this._exchangeRates.Find(KeyFor(money.Currency, to)).IfNone(0), Currency = to};

[Killed] Arithmetic mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Bank.cs:24:41
         private Money ConvertSafely(Money money, Currency to) =>
             to == money.Currency
                 ? money
-                : money with { Amount = money.Amount * this._exchangeRates.Find(KeyFor(money.Currency, to)).IfNone(0), Currency = to};
+                : money with { Amount = money.Amount / this._exchangeRates.Find(KeyFor(money.Currency, to)).IfNone(0), Currency = to};
 
         private bool CanConvert(Currency from, Currency to) =>

[Killed] Equality mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Bank.cs:27:17
                 : money with { Amount = money.Amount * this._exchangeRates.Find(KeyFor(money.Currency, to)).IfNone(0), Currency = to};
 
         private bool CanConvert(Currency from, Currency to) =>
-                from == to || this._exchangeRates.ContainsKey(KeyFor(from, to));
+                                from != to  || this._exchangeRates.ContainsKey(KeyFor(from, to));
 
         public Either<string, Money> Convert(Money money, Currency currency) =>

[Killed] Logical mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Bank.cs:27:17
                 : money with { Amount = money.Amount * this._exchangeRates.Find(KeyFor(money.Currency, to)).IfNone(0), Currency = to};
 
         private bool CanConvert(Currency from, Currency to) =>
-                from == to || this._exchangeRates.ContainsKey(KeyFor(from, to));
+                                from == to && this._exchangeRates.ContainsKey(KeyFor(from, to));
 
         public Either<string, Money> Convert(Money money, Currency currency) =>

[Killed] Negate expression
xtrem-tdd-agilille/c#/money-problem.Domain/Bank.cs:30:13
                 from == to || this._exchangeRates.ContainsKey(KeyFor(from, to));
 
         public Either<string, Money> Convert(Money money, Currency currency) =>
-            this.CanConvert(money.Currency, currency)
+            !(            this.CanConvert(money.Currency, currency)
+)
                 ? Either<string, Money>.Right(this.ConvertSafely(money, currency))
                 : Either<string, Money>.Left($"{money.Currency}->{currency}");
