[Killed] Arithmetic mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Money.cs:5:58
 
 public record Money(double Amount, Currency Currency)
 {
-    public Money Times(int times) => this with {Amount = this.Amount * times};
+    public Money Times(int times) => this with {Amount = this.Amount / times};
     public Money Divide(int divisor) => this with {Amount = this.Amount / divisor};
 

[Killed] Arithmetic mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Money.cs:6:61
 public record Money(double Amount, Currency Currency)
 {
     public Money Times(int times) => this with {Amount = this.Amount * times};
-    public Money Divide(int divisor) => this with {Amount = this.Amount / divisor};
+    public Money Divide(int divisor) => this with {Amount = this.Amount * divisor};
 
     public static Money Empty(Currency currency) => new Money(default, currency);
