[Killed] Block removal mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:14:5
     private Portfolio(Seq<Money> moneys) => this.moneys = moneys;
 
     public Either<string, Money> Evaluate(Bank bank, Currency currency)
-    {
-        var results = this.GetConvertedMoneys(bank, currency);
-        return ContainsFailure(results)
-            ? Either<string, Money>.Left(this.ToFailure(results))
-            : Either<string, Money>.Right(this.ToSuccess(results, currency));
-    }
+    {}
 
     private List<Either<string, Money>> GetConvertedMoneys(Bank bank, Currency currency) =>

[Killed] Negate expression
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:16:16
     public Either<string, Money> Evaluate(Bank bank, Currency currency)
     {
         var results = this.GetConvertedMoneys(bank, currency);
-        return ContainsFailure(results)
+        return !(ContainsFailure(results)
+)
             ? Either<string, Money>.Left(this.ToFailure(results))
             : Either<string, Money>.Right(this.ToSuccess(results, currency));

[Killed] Linq method mutation (Any() to All())
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:27:9
             .ToList();
 
     private static bool ContainsFailure(IEnumerable<Either<string, Money>> results) =>
-        results.Any(result => result.IsLeft);
+                results.All(result => result.IsLeft);
 
     private string ToFailure(IEnumerable<Either<string, Money>> results) =>

[Killed] String mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:30:9
         results.Any(result => result.IsLeft);
 
     private string ToFailure(IEnumerable<Either<string, Money>> results) =>
-        $"Missing exchange rate(s): {GetMissingRates(results)}";
+        $"";
 
     private static string GetMissingRates(IEnumerable<Either<string, Money>> missingRates) => missingRates

[Killed] String mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:33:25
         $"Missing exchange rate(s): {GetMissingRates(results)}";
 
     private static string GetMissingRates(IEnumerable<Either<string, Money>> missingRates) => missingRates
-        .Match(money => string.Empty, failure => $"[{failure}]")
+        .Match(money => "Stryker was here!", failure => $"[{failure}]")
         .Where(message => !string.IsNullOrEmpty(message))
         .Aggregate((r1, r2) => $"{r1},{r2}");

[Killed] String mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:33:50
         $"Missing exchange rate(s): {GetMissingRates(results)}";
 
     private static string GetMissingRates(IEnumerable<Either<string, Money>> missingRates) => missingRates
-        .Match(money => string.Empty, failure => $"[{failure}]")
+        .Match(money => string.Empty, failure => $"")
         .Where(message => !string.IsNullOrEmpty(message))
         .Aggregate((r1, r2) => $"{r1},{r2}");

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:34:27
 
     private static string GetMissingRates(IEnumerable<Either<string, Money>> missingRates) => missingRates
         .Match(money => string.Empty, failure => $"[{failure}]")
-        .Where(message => !string.IsNullOrEmpty(message))
+        .Where(message => string.IsNullOrEmpty(message))
         .Aggregate((r1, r2) => $"{r1},{r2}");
 

[Killed] Linq method mutation (Sum() to Max())
xtrem-tdd-agilille/c#/money-problem.Domain/Portfolio.cs:38:13
         .Aggregate((r1, r2) => $"{r1},{r2}");
 
     private Money ToSuccess(IEnumerable<Either<string, Money>> results, Currency currency) =>
-        new(results
-                .Where(result => result.IsRight)
-                .Sum(result => result.IfLeft(Money.Empty(currency)).Amount),
+        new(results
+                .Where(result => result.IsRight)
+                .Max(result => result.IfLeft(Money.Empty(currency)).Amount),
             currency);
 
